In [5]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'var1': [1, 2, 3],
                  'var2': ['one', 'two', 'three'],
                  'var3': [1.0, 2.0, 3.0]})
df

   var1   var2  var3
0     1    one   1.0
1     2    two   2.0
2     3  three   3.0

In [3]:
df = pd.DataFrame({'var1': pd.Series([1, 2, 3], dtype=float),
                  'var2': pd.Series(['a', 'b'])})
df

   var1 var2
0   1.0    a
1   2.0    b
2   3.0  NaN

In [6]:
df = pd.DataFrame(np.arange(16).reshape(4, 4),
                 index=['r1', 'r2', 'r3', 'r4'],
                 columns=['c1', 'c2', 'c3', 'c4'])
df

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15

In [7]:
df['c1']

r1     0
r2     4
r3     8
r4    12
Name: c1, dtype: int64

In [8]:
df.c1

r1     0
r2     4
r3     8
r4    12
Name: c1, dtype: int64

In [9]:
df[['c1', 'c2']]

    c1  c2
r1   0   1
r2   4   5
r3   8   9
r4  12  13

In [11]:
df1 = df['c1'].to_frame()
df1

    c1
r1   0
r2   4
r3   8
r4  12

In [12]:
df.loc['r1']

c1    0
c2    1
c3    2
c4    3
Name: r1, dtype: int64

In [14]:
df.iloc[0]

c1    0
c2    1
c3    2
c4    3
Name: r1, dtype: int64

In [15]:
df.loc['r1', 'c1']

0

In [16]:
df.loc[['r1', 'r2']]

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7

In [17]:
df.loc['r1': 'r3']

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11

In [18]:
df.iloc[0:2]

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7

In [21]:
df.iloc[[0, 1]]

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7

In [22]:
df.iloc[:, 2]

r1     2
r2     6
r3    10
r4    14
Name: c3, dtype: int64